#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vinnielee-io/bilh-tf-gh-actions-demo/runs/run-wssci3MEfYj74rxD

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
random_id.demo_id: Refreshing state... [id=ywyiGQ]
data.aws_ami.amazon_linux2: Reading...
aws_key_pair.bilh_demo_key_pair: Refreshing state... [id=bilh-aws-demo-master-key]
aws_vpc.tf_vpc: Refreshing state... [id=vpc-09a3bc04dfdc2679a]
data.aws_ami.amazon_linux2: Read complete after 0s [id=ami-0fe472d8a85bc7b0e]
aws_subnet.app: Refreshing state... [id=subnet-0179c89fc0981b1ec]
aws_subnet.db: Refreshing state... [id=subnet-00cd1c8b106aefb08]
aws_main_route_table_association.default_main: Refreshing state... [id=rtbassoc-004674edc221eeec6]
aws_subnet.web: Refreshing state... [id=subnet-0917a6d87bd3da127]
aws_default_security_group.default: Refreshing state... [id=sg-0361743fde6afc817]
aws_default_route_table.default_main: Refreshing state... [id=rtb-07b6c2d618f3ea6be]
aws_internet_gateway.tf_internet_gateway: Refreshing state... [id=igw-071cf10ea01f1972e]
aws_security_group.wordpress: Refreshing state... [id=sg-037d884bd5f4a9d7d]
aws_eip.tf_nat_gateway_eip: Refreshing state... [id=eipalloc-094e730b6de9e2465]
aws_route_table.tf_routetable_web_public: Refreshing state... [id=rtb-012b2229531a2a778]
aws_instance.wordpress_instance: Refreshing state... [id=i-0bb1eef9d345f2fb5]
aws_route_table_association.web_subnet: Refreshing state... [id=rtbassoc-0249bf54fa7605b77]
aws_nat_gateway.tf_nat_gateway: Refreshing state... [id=nat-0278948c837225d36]
aws_route_table.tf_routetable_app_db_private: Refreshing state... [id=rtb-0980c0f9a25fca866]
aws_route_table_association.app_subnet: Refreshing state... [id=rtbassoc-034b49904804a6760]
aws_route_table_association.db_subnet: Refreshing state... [id=rtbassoc-04ae8e65948d09161]
aws_instance.cli_created: Refreshing state... [id=i-07d83a0b5d5b93404]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.instance_3 will be created
  + resource "aws_instance" "instance_3" {
      + ami                                  = "ami-0fe472d8a85bc7b0e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bilh-aws-demo-master-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0917a6d87bd3da127"
      + tags                                 = {
          + "Name" = "terraform-cloud"
        }
      + tags_all                             = {
          + "Name"        = "terraform-cloud"
          + "automation"  = "terraform-managed"
          + "environment" = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-037d884bd5f4a9d7d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.wordpress will be updated in-place
  ~ resource "aws_security_group" "wordpress" {
        id                     = "sg-037d884bd5f4a9d7d"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ssh port 22 ipv4 from my workstation ip"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "173.48.219.198/32",
                ]
              - description      = "allow ssh port 22 ipv4 from my workstation ip"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "tf-us-east-1-wordpress-securitygroup-ywyiGQ"
        tags                   = {
            "Name" = "tf-us-east-1-wordpress-securitygroup-ywyiGQ"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @lee-vincent, Action: `pull_request`*